## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "88695007a51308039d3d341bee771c30-6" -> "fcc27c575bccc0e6e00c155dd0925077"
      ~ id                     = "graphql.c40c7d17e155ef4c733e5547292df79d.zip" -> (known after apply)
      ~ key                    = "graphql.c40c7d17e155ef4c733e5547292df79d.zip" -> "graphql.fcc27c575bccc0e6e00c155dd0925077.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "c40c7d17e155ef4c733e5547292df79d" -> "fcc27c575bccc0e6e00c155dd0925077"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "jSMpoc8zNcludekhV5xkTcIdhoYSb1xA" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "a3398d11d3218c26e0658d4f7b58b604" -> "1809105c97a47e6dd814140021bd3f22"
        id                     = "dist/200.html"
      ~ source_hash            = "a3398d11d3218c26e0658d4f7b58b604" -> "1809105c97a47e6dd814140021bd3f22"
        tags                   = {}
      ~ version_id             = ".h8kuQ2L3NZpTWxg898nPqJZg3W9LwQg" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "ddf902f53d848e3da774f14325656506" -> "f0f5692c5c8809d35edae447c28e3590"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "ddf902f53d848e3da774f14325656506" -> "f0f5692c5c8809d35edae447c28e3590"
        tags                   = {}
      ~ version_id             = "ko7qcC8SYIzAvt8NpZQPHrYT7IRbq1bY" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "7883262ca02bd1a4cdb7f5e7ba4ed71c" -> "753c9136030c74bf48c598b5a82182d2"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "7883262ca02bd1a4cdb7f5e7ba4ed71c" -> "753c9136030c74bf48c598b5a82182d2"
        tags                   = {}
      ~ version_id             = "j45WR3SJEgx6KlEEGjuc7yFQ.uwjkYqA" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "a3398d11d3218c26e0658d4f7b58b604" -> "1809105c97a47e6dd814140021bd3f22"
        id                     = "dist/index.html"
      ~ source_hash            = "a3398d11d3218c26e0658d4f7b58b604" -> "1809105c97a47e6dd814140021bd3f22"
        tags                   = {}
      ~ version_id             = ".cnHBcx7grSk5RGZ1GEMRy_X9hNJ9MiY" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/358.abc86593.chunk.js"] will be destroyed
  # (because key ["static/js/358.abc86593.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "ff19f78459d9bd93a2b242483930720b" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/358.abc86593.chunk.js" -> null
-       key                    = "dist/static/js/358.abc86593.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/358.abc86593.chunk.js" -> null
-       source_hash            = "ff19f78459d9bd93a2b242483930720b" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "NaIfzrd5aIU6QF65PZAOlLypSxUdisvK" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/358.abc86593.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/358.abc86593.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "44c92a2e2086755c7f2972bde204ca02" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/358.abc86593.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/358.abc86593.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/358.abc86593.chunk.js.LICENSE.txt" -> null
-       source_hash            = "44c92a2e2086755c7f2972bde204ca02" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "IyionE1LvKUVvEglkPs7hE5OwvuC3LOk" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/477.2ba1adfc.chunk.js"] will be destroyed
  # (because key ["static/js/477.2ba1adfc.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "4c090ce9c84eb03a9ff85f2598e6d30f" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/477.2ba1adfc.chunk.js" -> null
-       key                    = "dist/static/js/477.2ba1adfc.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/477.2ba1adfc.chunk.js" -> null
-       source_hash            = "4c090ce9c84eb03a9ff85f2598e6d30f" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "S2fXa6poVR6S34eenxqthtRv2vIFh5te" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/477.2ba1adfc.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/477.2ba1adfc.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "2498881cb4526335bc5aa2f1fc16bb63" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/477.2ba1adfc.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/477.2ba1adfc.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/477.2ba1adfc.chunk.js.LICENSE.txt" -> null
-       source_hash            = "2498881cb4526335bc5aa2f1fc16bb63" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "tcUzW4EsnJBGeBVOfS7Aw2ldah1_AXX3" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/504.d1f9a630.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "cb5744ee815de61b61ef4e31bd49a77a"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/504.d1f9a630.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/504.d1f9a630.chunk.js"
+       source_hash            = "cb5744ee815de61b61ef4e31bd49a77a"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/504.d1f9a630.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "db6b18301fc763e7ad4cf43d579a2390"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/504.d1f9a630.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/504.d1f9a630.chunk.js.LICENSE.txt"
+       source_hash            = "db6b18301fc763e7ad4cf43d579a2390"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/57.bc58867e.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "d920bd51c27cdaa42482d2196bcf620c"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/57.bc58867e.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/57.bc58867e.chunk.js"
+       source_hash            = "d920bd51c27cdaa42482d2196bcf620c"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/57.bc58867e.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "406ecf0d41f22ef13cd249dc3bd0e9cd"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/57.bc58867e.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/57.bc58867e.chunk.js.LICENSE.txt"
+       source_hash            = "406ecf0d41f22ef13cd249dc3bd0e9cd"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/766.425b18b0.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "fbd0fd5f8254ec9637adfebd084ffbac"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/766.425b18b0.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/766.425b18b0.chunk.js"
+       source_hash            = "fbd0fd5f8254ec9637adfebd084ffbac"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/766.425b18b0.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "db6b18301fc763e7ad4cf43d579a2390"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/766.425b18b0.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/766.425b18b0.chunk.js.LICENSE.txt"
+       source_hash            = "db6b18301fc763e7ad4cf43d579a2390"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/857.f1bf4106.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "6f19cd804c80eef19fae558b4b613d66"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/857.f1bf4106.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/857.f1bf4106.chunk.js"
+       source_hash            = "6f19cd804c80eef19fae558b4b613d66"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/857.f1bf4106.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "d825a6f2004b3fd31ff641844be018f4"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/857.f1bf4106.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/857.f1bf4106.chunk.js.LICENSE.txt"
+       source_hash            = "d825a6f2004b3fd31ff641844be018f4"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/917.07d83fe6.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "e53ad483f990b20652794ad6053094f2"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/917.07d83fe6.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/917.07d83fe6.chunk.js"
+       source_hash            = "e53ad483f990b20652794ad6053094f2"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/917.07d83fe6.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "f8dc5b59d9eb01e0996ba3b4ae93ebb9"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/917.07d83fe6.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/917.07d83fe6.chunk.js.LICENSE.txt"
+       source_hash            = "f8dc5b59d9eb01e0996ba3b4ae93ebb9"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/ReportingPeriodsPage.a05a89c7.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "c78c99b3268ad8160aae48814ffe1970"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/ReportingPeriodsPage.a05a89c7.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/ReportingPeriodsPage.a05a89c7.chunk.js"
+       source_hash            = "c78c99b3268ad8160aae48814ffe1970"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/ReportingPeriodsPage.a05a89c7.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "f5f55de2a92d07d053bb65b442fc8140"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/ReportingPeriodsPage.a05a89c7.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/ReportingPeriodsPage.a05a89c7.chunk.js.LICENSE.txt"
+       source_hash            = "f5f55de2a92d07d053bb65b442fc8140"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadTemplatePage.1012096c.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "c281059fe234013634743d32417073e9"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadTemplatePage.1012096c.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadTemplatePage.1012096c.chunk.js"
+       source_hash            = "c281059fe234013634743d32417073e9"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadTemplatePage.1012096c.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "9af098a0eeaad13a23ce12d7172813ee"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadTemplatePage.1012096c.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadTemplatePage.1012096c.chunk.js.LICENSE.txt"
+       source_hash            = "9af098a0eeaad13a23ce12d7172813ee"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.7ac863b8.js"] will be destroyed
  # (because key ["static/js/app.7ac863b8.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "8791de0e6644ae2438232e2999fd88db" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.7ac863b8.js" -> null
-       key                    = "dist/static/js/app.7ac863b8.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.7ac863b8.js" -> null
-       source_hash            = "8791de0e6644ae2438232e2999fd88db" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "zMg2cCJO9jW8jd8dnpZ4F2KpFC3XCPeu" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.7ac863b8.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.7ac863b8.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "06940a9aab784938d8e0d53a11e0886f" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.7ac863b8.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.7ac863b8.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.7ac863b8.js.LICENSE.txt" -> null
-       source_hash            = "06940a9aab784938d8e0d53a11e0886f" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "hpSEBQx0VyTqQ52uEB3394IzqVL9olmX" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.be792c84.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "799e4d74176e4e9bbda141b725234a80"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.be792c84.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.be792c84.js"
+       source_hash            = "799e4d74176e4e9bbda141b725234a80"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.be792c84.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "5dd1bb9d25af81742683d7c8584ce16a"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.be792c84.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.be792c84.js.LICENSE.txt"
+       source_hash            = "5dd1bb9d25af81742683d7c8584ce16a"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.15449ba9.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "5b74562aa291c76ee19348292ef6662b"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/runtime-app.15449ba9.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.15449ba9.js"
+       source_hash            = "5b74562aa291c76ee19348292ef6662b"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.29fe59d2.js"] will be destroyed
  # (because key ["static/js/runtime-app.29fe59d2.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "66ac9cb1d76edbf486166c876fbbc171" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/runtime-app.29fe59d2.js" -> null
-       key                    = "dist/static/js/runtime-app.29fe59d2.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.29fe59d2.js" -> null
-       source_hash            = "66ac9cb1d76edbf486166c876fbbc171" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "UuLRk59vEWEFvy_YHdh1gk9SEcoDtN2X" -> null
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ last_modified                  = "2023-12-07T18:31:23.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:13" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:13/invocations" -> (known after apply)
      ~ s3_key                         = "graphql.c40c7d17e155ef4c733e5547292df79d.zip" -> "graphql.fcc27c575bccc0e6e00c155dd0925077.zip"
        tags                           = {}
      ~ version                        = "13" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                            = "git.commit.sha:ebd6ae2ac58b579cb6ef92038317cfeb0bd61b73,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:6290d69c1e575593f1df3732680028b2b4832f0e,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "ebd6ae2ac58b579cb6ef92038317cfeb0bd61b73" -> "6290d69c1e575593f1df3732680028b2b4832f0e"
                # (13 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "13" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 19 to add, 5 to change, 9 to destroy.
```

</details>

*Pusher: @dysmento, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/7132712419)*